{
  "Apple___Apple_scab": "Apply fungicides containing captan or myclobutanil. Remove fallen leaves and infected fruit. Prune trees to improve air circulation.",
  "Apple___Black_rot": "Remove infected fruit and cankers. Apply fungicides during the growing season. Practice proper sanitation.",
  "Apple___Cedar_apple_rust": "Remove nearby cedar trees if possible. Apply fungicides in early spring. Use rust-resistant apple varieties.",
  "Apple___healthy": "Your apple plant is healthy! Continue regular care and monitoring.",
  "Blueberry___healthy": "Your blueberry plant is healthy! Maintain proper watering and fertilization.",
  "Cherry_(including_sour)___Powdery_mildew": "Apply sulfur-based fungicides. Prune to improve air circulation. Water at the base of plants.",
  "Cherry_(including_sour)___healthy": "Your cherry plant is healthy! Keep up the good work.",
  "Corn_(maize)___Cercospora_leaf_spot Gray_leaf_spot": "Use resistant varieties. Apply foliar fungicides. Practice crop rotation.",
  "Corn_(maize)___Common_rust_": "Plant resistant hybrids. Apply fungicides if infection is severe. Remove infected leaves.",
  "Corn_(maize)___Northern_Leaf_Blight": "Use resistant corn varieties. Apply fungicides early. Practice crop rotation.",
  "Corn_(maize)___healthy": "Your corn plant is healthy! Continue proper irrigation and fertilization.",
  "Grape___Black_rot": "Apply fungicides starting at bud break. Remove mummified berries. Prune to improve air flow.",
  "Grape___Esca_(Black_Measles)": "Prune infected vines. Apply wound protectants. No effective chemical control exists.",
  "Grape___Leaf_blight_(Isariopsis_Leaf_Spot)": "Apply copper-based fungicides. Remove infected leaves. Improve vineyard sanitation.",
  "Grape___healthy": "Your grape plant is healthy! Continue regular monitoring.",
  "Orange___Haunglongbing_(Citrus_greening)": "Remove infected trees immediately. Control psyllid insects. Use disease-free nursery stock.",
  "Peach___Bacterial_spot": "Apply copper sprays. Use resistant varieties. Avoid overhead irrigation.",
  "Peach___healthy": "Your peach plant is healthy! Maintain good cultural practices.",
  "Pepper,_bell___Bacterial_spot": "Use copper-based bactericides. Plant resistant varieties. Avoid overhead watering.",
  "Pepper,_bell___healthy": "Your pepper plant is healthy! Continue proper care.",
  "Potato___Early_blight": "Apply fungicides containing chlorothalonil. Remove infected leaves. Practice crop rotation.",
  "Potato___Late_blight": "Apply fungicides immediately. Remove infected plants. Avoid overhead irrigation.",
  "Potato___healthy": "Your potato plant is healthy! Monitor regularly for diseases.",
  "Raspberry___healthy": "Your raspberry plant is healthy! Continue regular maintenance.",
  "Soybean___healthy": "Your soybean plant is healthy! Maintain proper field management.",
  "Squash___Powdery_mildew": "Apply sulfur or potassium bicarbonate. Improve air circulation. Remove infected leaves.",
  "Strawberry___Leaf_scorch": "Remove infected leaves. Apply fungicides. Ensure proper spacing for air flow.",
  "Strawberry___healthy": "Your strawberry plant is healthy! Keep monitoring.",
  "Tomato___Bacterial_spot": "Use copper-based sprays. Plant resistant varieties. Avoid working with wet plants.",
  "Tomato___Early_blight": "Apply fungicides containing chlorothalonil or copper. Remove lower infected leaves. Mulch around plants.",
  "Tomato___Late_blight": "Apply fungicides immediately. Remove and destroy infected plants. Avoid overhead watering.",
  "Tomato___Leaf_Mold": "Improve air circulation. Reduce humidity. Apply fungicides if needed.",
  "Tomato___Septoria_leaf_spot": "Remove infected leaves. Apply fungicides. Mulch to prevent soil splash.",
  "Tomato___Spider_mites Two-spotted_spider_mite": "Spray with insecticidal soap or neem oil. Increase humidity. Remove heavily infested leaves.",
  "Tomato___Target_Spot": "Apply fungicides. Remove infected leaves. Improve air circulation.",
  "Tomato___Tomato_Yellow_Leaf_Curl_Virus": "Control whitefly vectors. Remove infected plants. Use virus-resistant varieties.",
  "Tomato___Tomato_mosaic_virus": "Remove infected plants. Disinfect tools. Use resistant varieties. Control aphid vectors.",
  "Tomato___healthy": "Your tomato plant is healthy! Continue regular care and monitoring."
}
